<template>
  <van-popup v-model="visible" class="ch-selectmap">
    <div class="member-content">
      <h3 class="member-content-title">
        <van-icon class="arrow-left" name="arrow-left" @click="visible = false" />
        钱大妈团长合作协议
      </h3>
      <!-- <div class="agree-part">
        <div class="agree-title">重要提示：</div>
        <div class="agree-content">请您仔细阅读以下条款，并确认您已完全理解</div>
      </div> -->
      <div class="agree-part">
        <div class="agree-content">
          甲方：广州市钱大妈生鲜食品连锁有限公司<br/>
          联系人：<br/>
          联系方式：<br/><br/>
          <div v-html="'乙方（团长）：&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;微信号：'"/>
          <div v-html="'联系电话：&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;身份证号码：'"/>自提点地址：	 
        </div>
        <div class="agree-title">本协议中以黑体字标示出的为涉及甲方与乙方的重大权益的规则，该等规则可能涉及相关方的责任免除或限制、法律适用与争议解决条款，请重点阅读。</div>
        <div class="agree-content">
          鉴于：<br/>
          甲方系依法设立并有效存续的企业法人，能够独立承担法律责任，并具有履行本协议所需的一切权利及能力。<br/>
          乙方系具有完全民事行为能力的自然人，<span class="bold">有固定提货点，并保证及时收取货物，妥善存放货物，</span>能够独立承担法律责任，并具有履行本协议所需的一切权利和履约能力。<br/>
          本协议由广州市钱大妈生鲜食品连锁有限公司（以下简称“甲方”）与团长（以下简称“乙方”）共同签署。
        </div>
        <div class="agree-content">
          <span class="bold">第一条 定义</span><br/>
          1.1钱大妈精选商城：是指由甲方所运营和管理的为用户和团长站点的交易活动（包括商品信息发布、商品订购提取等）提供综合技术支持的网络交易平台，该平台提供综合技术支持的途径包括但不限于钱大妈精选商城微信小程序及未来开发产生的其它形式。<br/>
          1.2精选商城团长端：是指为实现乙方提供的推广、短期存储、分拣、售后等服务开发的微信小程序，包含未来可能上线的任何其他移动客户端。<br/>
          1.3用户：钱大妈精选商城上注册或者下单购物的法人、自然人及其他非法人组织。<br/>
          1.4团长：即本协议中的乙方，是指自愿入驻钱大妈精选商城团长端，承接甲方发布的服务任务为钱大妈精选商城提供商品的推广、短期存储、分拣、售后等服务，以满足用户的相关需求的实际服务提供方。<br/>
          <br/>
        </div>
        <div class="agree-content">
          第二条 承诺和保证<br/>
          2.1 乙方须遵守国家法律法规的规定，包括但不限于遵守用户信息安全保护、广告营销及电子商务、消费者权益保护法等相关法律法规的规定，且不能损害甲方、用户、钱大妈精选商城及其营运方的利益。如乙方因上述行为致使上述各方遭受处罚或损失的，甲方采取包括但不限于冻结、扣抵服务费、提起诉讼等方式向乙方追偿损失。
          <span class="bold">
            2.2 乙方应遵守甲方的各项规则以及管理规定，包括但不限于本协议甲方发布的各类规则、操作流程以及钱大妈精选商城团长端的适用协议等。以上规则、管理规定、协议等甲方有权委以修改、更新等方式不时调整，相关内容将公布于钱大妈精选商城或以其他方式通知乙方。除非乙方明示并书面向钱大妈精选商城团长端的工作人员提出申明表示不愿接受调整后的内容，否则调整后的内容将于公布之日或通知另行指定的日期开始生效，且视为乙方认可并同意遵守。
          </span>
          <br/>
          2.3 乙方承诺在钱大妈精选商城团长端提交的乙方的姓名、身份证号码、手机号码、所在小区、开团微信群等信息均真实、有效、完整，并承诺如上述信息发生变更后，第一时间在钱大妈精选商城团长端上进行相应信息变更操作，否则甲方有权下线或者关停乙方账号，给甲方或者第三方造成损失的，甲方有权向乙方索赔，索赔方式包括但不限于冻结、扣抵服务费、提起诉讼等方式。<br/>
          2.4 乙方承诺并保证不通过钱大妈精选商城团长端或者钱大妈精选商城业务、系统漏洞或其它手段等侵害甲方权益；不采用伪造订单等方式虚构销售额或销售量；不进行夸大或不实宣传推广、散播谣言等；不将任何涉及钱大妈精选商城或客户的信息透露给第三方或用于其他商业活动。若乙方的行为给甲方或者第三方造成损失的，甲方有权向乙方索赔，索赔方式包括但不限于冻结、扣抵服务费、提起诉讼等方式。

        </div>
        <div class="agree-content">
          <span class="bold">第三条 合作内容</span><br/>
          3.1乙方通过钱大妈精选商城团长端，接收推送和展示的商品信息，并通过其自有或合法占有及管理的线下场地以及线上渠道等，承接甲方发布的服务任务，为钱大妈精选商城提供推广、分拣、短期存储、售后等服务，满足用户相关需求。包括但不限于如下具体内容：<br/>
          3.1.1推广服务：创建和不断壮大用户微信群（＞100人），利用微信群和朋友圈等渠道推广钱大妈精选商城的商品链接，引导用户下单，并对用户提供答疑、咨询等服务。<br/>
          3.1.2分拣、短期存储等服务：<br/>
          （1）对接钱大妈精选商城合作伙伴的送货司机，完整高效地完成收货、分拣、理货和存放，并及时通知用户取货，将商品完整无缺地交给用户；<br/>
          （2）乙方必须有足够的时间、合适的存储空间为用户提供货物自提服务，保证商品的有效存放、分发，并保证商品符合要求到达用户手中。如因乙方原因导致商品变质、腐烂或丢失，均由乙方承担相应损失。<br/>
          （3）乙方确认用户取货地址的有效性，在用户取货后应及时针对采购单确认收货。<br/>
          3.2.2提供售后服务：<br/>
          （1）对于产生客诉、售后等问题的用户，及时进行沟通安抚，并引导用户按甲方的要求进行售后；<br/>
          （2）对于食品安全等紧急或意外情况，乙方应按照甲方的要求联系客服处理，及时、如实告知甲方相关情况。<br/>
          3.3乙方在提供服务过程中应当严格遵守钱大妈精选商城团长端发布的《团长规范与要求》。
        </div>
        <div class="agree-content">
          <span class="bold">第四条 费用</span><br/>
          <span class="bold">4.1 乙方入驻协成云信息科技有限公司共享经济平台（以下简称“协成科技”），与江西协成云信息科技有限公司签订《协成科技与自由职业者之共享经济合作伙伴协议》，经协成科技介绍，以自由职业者的身份与甲方开展团长服务合作。</span><br/>
          4.2 乙方同意结算时间及方式等按乙方与协成科技签订的协议的约定执行，由协成科技代付服务费用。<br/>
          4.3乙方及其相关账号违反本协议约定的诚实信用义务的订单不计入结算范围。<br/>
          <span class="bold">4.4乙方有应付未付款项、违约金等费用的，甲方有权就上述费用行使抵扣权。</span><br/>
          <span class="bold"> 4.5乙方在收到服务费用后的15个自然日内对当期款项应详细审核，</span>若有异议应在15个自然日内向甲方书面提出异议，甲方可以协助查询。<span class="bold">逾期未提出的，即视为乙方认可协成科技支付的金额。</span><br/>
          4.6未取得甲方的书面同意，乙方不得将其在本协议项下的全部或部分的债权转让给任何第三方。
        </div>
        <div class="agree-content">
          <span class="bold">第五条 双方权利义务</span><br/>
          5.1 甲方权利义务<br/>
          5.1.1 甲方有权根据其业务政策、战略规划随时调整本协议项下乙方应提供的营销推广服务内容或者计费规则等，但甲方需在合理时间内提前通知乙方。<br/>
          5.1.2 为了保证用户的权益，为其提供更好的服务与保障，乙方同意甲方（可转委托他人）加入乙方用于推广业务建立的微信群。<br/>
          5.1.3 甲方应按照本协议的约定通过信息技术服务有限公司向乙方按时支付服务费。<br/>
          5.1.4 甲方将不定期为乙方提供系统操作及业务管理等与本协议相关的培训。<br/>
          <span class="bold">5.2 乙方权利义务</span><br/>
          5.2.1 乙方有权按照本协议的约定收取其履行营销推广承揽义务的服务费。<br/>
          5.2.2 钱大妈精选商城以及钱大妈精选商城团长端显示的商品及服务信息均由甲方提供。乙方应当及时关注相关推送或展示的商品、服务信息的变化。<br/>
          5.2.3 乙方必须按照甲方发布的要求完成承揽服务。
        </div>
        <div class="agree-content">
          <span class="bold">第六条  协议终止及转让</span><br/>
          6.1 本协议在符合以下任意一项情形时终止：<br/>
          <span class="bold">6.1.1自然终止：如乙方签署的《协成科技与自由职业者之共享经济合作伙伴协议》等因任何原因终止，则本协议将同时终止。</span><br/>
          <span class="bold">6.1.2通知解除：甲方有权提前3个自然日以电话、微信、微信小程序消息等方式通知乙方终止本协议而无须承担违约责任。</span><br/>
          <span class="bold">6.1.3单方解除权：出现下列情况之一的，甲方有权立刻终止本协议，且按有关规则索赔：</span><br/>
          <span class="bold">（1）乙方违反本协议中的承诺、保证、义务的；</span><br/>
          <span class="bold">（2）乙方违反其须遵守的规则的，包括但不限于《团长的规范与要求》；</span><br/>
          <span class="bold">（3）其他严重侵害甲方及甲方关联公司、用户、甲方或者其他第三方利益的行为。</span><br/>
          6.2协议终止后的权利义务<br/>
          6.2.1本协议终止后乙方不得再以甲方名义对外进行宣传及推广活动。<br/>
          6.2.2但本协议终止前已经发生的交易，团长仍需向甲方、用户、或其他第三方继续履行售后等附随义务。
        </div>
         <div class="agree-content bold">
           第七条 违约责任<br/>
          乙方明确理解并同意，如因乙方违反有关法律法规、相关规则或者本协议之约定，使甲方遭受任何损失、受到用户或任何其他第三方的索赔或者遭受任何行政管理部门处罚的，乙方应对甲方进行全额赔偿，赔偿包括但不限于直接和间接损失以及为维权所支付的律师费、公证费等费用。
        </div>
        <div class="agree-content bold">
          第八条 特殊条款<br/>
          8.1乙方理解并认可，加入钱大妈精选商城开展业务意味着乙方同意将乙方的身份信息、销售数据等信息向相关信息方进行必要的披露,乙方深刻理解并认可信息披露可能引发的问题、风险，并愿意自行承担该等风险及后果。<br/>
          8.2本协议的签署、乙方的审核通过并不意味着甲方对乙方的合作身份、资质、履约能力、采购、销售等行为或乙方自行上传、发布的信息的真实性、准确性、合法性、有效性承担任何明示或暗示的保证或担保等责任。因乙方的行为导致的任何投诉、纠纷、争议、赔偿等乙方应以自己的名义独立承担所有法律责任。<br/>
          8.3甲方对乙方营业额、利润、盈利不作任何承诺，乙方应自行承担与甲方合作所需的一切资金，盈亏自负。<br/>
          8.4甲方对于乙方的承诺，均以加盖甲方公章的书面方式文件为有效，否则该承诺对各方均不具有法律约束效力。<br/>
          8.5甲方由于对系统、网站及应用进行维护、技术检测等造成乙方营运中断的，不视为甲方违约且不承担任何责任。<br/>
          8.6甲方有权将本协议项下的全部权利和义务转让予第三方，而无须征得乙方的同意，届时甲方将通过短信、微信、钱大妈精选商城团长端页面公告等方式向乙方发出转让通知。
        </div>
        <div class="agree-content">
          <span class="bold">第九条  其他约定</span><br/>
          9.1本协议适用中华人民共和国大陆地区法律，如甲方与乙方就本协议的签订、履行或解释发生争议，双方应努力友好协商解决。如协商不成，乙方同意由<span class="bold">广州市海珠区人民法院</span>解决双方的纠纷或争议。<br/>
          9.2协议签订之前,甲乙双方已有业务往来但未签署协议的,本协议效力追溯至双方发生业务往来时，即自双方发生业务往来之始，本协议对双方就有约束力。钱大妈精选商城团长端向乙方的推送内容、商品信息均构成对本协议的补充，与本协议具有同等法律效力。<br/>
          9.3本协议附件包括附件一《隐私承诺保护函》、钱大妈精选商城团长端《团长的规范与要求》，是本协议不可分割的组成部分，与本协议具有同等法律效力，本协议附件与本协议有冲突的，以附件为准。乙方在钱大妈精选商城团长端确认的单独事项如构成对本协议及附件的补充或者修改的，则甲方或甲方委托甲方确认的内容也是本协议的组成部分，优先适用最新修改或补充内容。<br/>
          9.4本协议自双方签字盖章之日起生效，一式两份，双方各执一份，均具有同等法律效力。
        </div>
        <div class="agree-content bold">
          （以下无正文）<br/><br/><br/>
          甲方(签章):<br/>
          日期：      年   月   日<br/><br/>
          乙方(签章):  <br/>
          日期：      年   月   日
        </div>

      </div>
    </div>
  </van-popup>
</template>
<script>
export default {
  data() {
    return {
      visible: false,
    };
  },
  mounted() {},
  methods: {
    show() {
      this.visible = true;
    },
  },
};
</script>
<style lang="scss" scoped>
@import "./common.scss";
.agree-part {
  margin: 20px 16px 24px;
  line-height: 21px;
  .agree-title {
    color: #000000;
    // font-size: 14px;
    // line-height: 20px;
    margin-bottom: 11px;
    margin-top: 20px;
    font-weight: bold;
    
  }
  .agree-content {
      color: #999999;
      margin-bottom: 20px;
      line-height: 21px;
      &.bold,.bold {
        color: #000000;
        font-weight: bold;
      }
  }
}
.ch-selectmap {
  top: 0;
  bottom: 0;
  left: 0;
  right: 0;
  margin: auto;
  transform: translate3d(0, 0, 0);
  background-color: #f7f7f7;
}
.member-content{
  position: fixed;
  height: 100%;
  overflow: scroll;
  top: 0;
  left: 0;
  right: 0;
  bottom: 0;
  margin: auto;
  padding-top: 40px;
  box-sizing: border-box;
}
</style>
